artillery/create-channels.yml
config:
  target: 'http://20.73.25.188:8080/SCC-TP1-1.0-SNAPSHOT/rest'
#  target: 'http://localhost:8080/scc2122-backend/rest'
  http:
    timeout: 10
  plugins:
    metrics-by-endpoint: {}
  processor: "./test-utils.js"
  variables:
     metricsProcessEndpoint : "myProcessEndpoint"  # function used to aggregate endpoints for statistics
  phases:
  - name: "Create channels"    # Create channels
    duration: 1
    arrivalCount: 1

scenarios:
  - name: 'Create channels'
    weight: 1
    flow:
      - loop:                            # let's create 10 public channels - loop ... count
        - function: "selectUserSkewed"
        - post:                          # First: login as a user
            url: "/auth"
            headers:
              Content-Type: application/json
            json:
              user: "{{ user }}"
              pwd: "{{ pwd }}"
        - function: "genNewChannel"
        - post:
            url: "/channel"
            headers:
              Content-Type: application/json
              Accept: application/json
            json:
              id: "1"
              name: "test"
              owner: "{{ user }}"
              publicChannel: false
              members: [ ]
            capture: # Capturing channel id
              json: $.id
              as: "channelId"
        - loop:                          # Let's add 20 users to the channel
          - function: "selectUserSkewed"
          - post:                         
              url: "/auth"
              headers:
                Content-Type: application/json
              json:
                user: "{{ user }}"
                pwd: "{{ pwd }}"
          - post:                          # Subscribe     
              url: "/user/subscribe/{{ user }}/{{ channelId }}"
          count: 20
        count: 10   
      - loop:                            # let's create 45 private channels - loop ... count
        - function: "selectUserSkewed"
        - post:                          # First: login as a user
            url: "/auth"
            headers:
              Content-Type: application/json
            json:
              user: "{{ user }}"
              pwd: "{{ pwd }}"
        - function: "genNewChannel"
        - post:                          # Create channel
            url: "/channel"
            headers:
              Content-Type: application/json
              Accept: application/json
            json:
              id: "1"
              name: "test"
              owner: "{{ user }}"
              publicChannel: false
              members: [ ]
            capture: # Capturing channel id
              json: $.id
              as: "channelId"
        - loop:                          # Let's add 10 users to the channel
          - function: "selectUserSkewed2"
          - post:                          # Add user to private channel   
              url: "/user/invite/{{ user }}/{{ channelId }}/{{ user2 }}"
          count: 10
        count: 45