artillery/passive.yml
config:
  target: 'http://20.73.25.188:8080/SCC-TP1-1.0-SNAPSHOT/rest'
#  target: 'http://localhost:8080/scc2122-backend/rest'
  http:
    timeout: 10
  plugins:
    metrics-by-endpoint: {}
  processor: "./test-utils.js"
  variables:
     metricsProcessEndpoint : "myProcessEndpoint"  # function used to aggregate endpoints for statistics
  phases:
  - name: "Warm up"
    arrivalRate: 1
    duration: 10
  - name: "Test"
    arrivalRate: 1
    duration: 60

scenarios:
  - name: 'Passive reader'
    weight: 10
    flow:
      - function: "selectUserSkewed"
      - post:                          # First: login as a user
          url: "/auth"
          headers:
            Content-Type: application/json
          json:
            user: "{{ user }}"
            pwd: "{{ pwd }}"
      - loop:
        - get:                          # Get user channels
            url: "/user/{{ user }}/channels"
            headers:
              Accept: application/json
            capture:
              json: "$"
              as: "channelLst"
        - function: "selectChannelFromChannelLstSkewed"   # Select channel to read messages
        - get:
            url: "/channel/{{ channelId }}/messages?st=0&len=1000000"
            headers:
              Accept: application/json
            capture:
              json: "$"
              as: "msgList"
            ifTrue: "channelId"
        - function: "selectImagesIdFromMsgList"   # Select imageIds from MsgList
        - loop:                                   # load images
            - get:
                url: "/media/{{ $loopElement }}"
                headers:
                  Accept: application/octet-stream
          over: "imageIdLst"
        whileTrue: "random50"